Tekla Open API Reference for Tekla Structures 2025
AnalysisResultPositions.aPositionsX Property
 The X coordinates of the positions.
 Namespace: Tekla.Structures.Analysis
 Assembly: Tekla.Structures.Analysis (in Tekla.Structures.Analysis.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public ArrayList aPositionsX { get; }
Public ReadOnly Property aPositionsX As ArrayList
	Get
Property Value
Type: ArrayList
See Also
Reference
AnalysisResultPositions Class
Tekla.Structures.Analysis Namespace